PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/audio_codec.c
  /* Deinitialize all the GPIOs used by the driver */
  //GPIO_InitStructure.GPIO_Pin =  CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN;
  //GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  //GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  //GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  //GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  //GPIO_Init(CODEC_I2S_GPIO, &GPIO_InitStructure);  
  
  GPIO_InitStructure.Pin = CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN; 
  GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
  GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(CODEC_I2S_GPIO, &GPIO_InitStructure);
  
  
  //GPIO_InitStructure.GPIO_Pin = CODEC_I2S_WS_PIN ;
  //GPIO_Init(CODEC_I2S_WS_GPIO, &GPIO_InitStructure);    
  GPIO_InitStructure.Pin = CODEC_I2S_WS_PIN ;
  HAL_GPIO_Init(CODEC_I2S_WS_GPIO, &GPIO_InitStructure); 
  
  /* Disconnect pins from I2S peripheral  */
  //GPIO_PinAFConfig(CODEC_I2S_WS_GPIO, CODEC_I2S_WS_PINSRC, 0x00);  
  //GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_SCK_PINSRC, 0x00);
  //GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_SD_PINSRC, 0x00);  
  
#ifdef CODEC_MCLK_ENABLED
  /* CODEC_I2S pins deinitialization: MCK pin */
  //GPIO_InitStructure.GPIO_Pin = CODEC_I2S_MCK_PIN; 
  //GPIO_Init(CODEC_I2S_MCK_GPIO, &GPIO_InitStructure);   
  /* Disconnect pins from I2S peripheral  */
  //GPIO_PinAFConfig(CODEC_I2S_MCK_GPIO, CODEC_I2S_MCK_PINSRC, CODEC_I2S_GPIO_AF);
  
  GPIO_InitStructure.Pin = CODEC_I2S_MCK_PIN; 
  HAL_GPIO_Init(CODEC_I2S_MCK_GPIO, &GPIO_InitStructure); 
#endif /* CODEC_MCLK_ENABLED */    
}

/**
  * @brief  Inserts a delay time (not accurate timing).
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void Delay( __IO uint32_t nCount)
{
  for (; nCount != 0; nCount--);
}

#ifdef USE_DEFAULT_TIMEOUT_CALLBACK
/**
  * @brief  Basic management of the timeout situation.
  * @param  None
  * @retval None
  */
uint32_t Codec_TIMEOUT_UserCallback(void)
{
  /* Block communication and all processes */
  while (1)
  {   
  }
}
#endif /* USE_DEFAULT_TIMEOUT_CALLBACK */
/*========================
                Audio MAL Interface Control Functions
                                                ==============================*/

/**
  * @brief  Initializes and prepares the Media to perform audio data transfer 
  *         from Media to the I2S peripheral.
  * @param  None
  * @retval None
  */
static void Audio_MAL_Init(void)  
{ 
  
#ifdef I2S_INTERRUPT  
  //NVIC_InitTypeDef   NVIC_InitStructure;

  //NVIC_InitStructure.NVIC_IRQChannel = SPI3_IRQn;
  //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;//sop1hc : 0
  //NVIC_InitStructure.NVIC_IRQChannelSubPriority =1;
  //NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  //NVIC_Init(&NVIC_InitStructure);
  
  //SPI_I2S_ITConfig(SPI3, SPI_I2S_IT_TXE, ENABLE);

  //I2S_Cmd(SPI3, ENABLE); 
  
  /* Enable and set Button EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)SPI3_IRQn, 0x00, 0x01);
  HAL_NVIC_EnableIRQ((IRQn_Type)SPI3_IRQn);
  
#else  
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
  //NVIC_InitTypeDef NVIC_InitStructure;
#endif

  if (CurrAudioInterface == AUDIO_INTERFACE_I2S)
  {
    /* Enable the DMA clock */
    //RCC_AHB1PeriphClockCmd(AUDIO_MAL_DMA_CLOCK, ENABLE); 
    //RCC_AHB1Periph_DMA1
    __HAL_RCC_DMA1_IS_CLK_ENABLED();  
    
    /* Configure the DMA Stream */
    DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);
    DMA_DeInit(AUDIO_MAL_DMA_STREAM);
	
    /* Set the parameters to be configured */
    //DMA_InitStructure.DMA_Channel = AUDIO_MAL_DMA_CHANNEL;  
     DmaHandle.Init.Channel = AUDIO_MAL_DMA_CHANNEL;
    //DMA_InitStructure.DMA_PeripheralBaseAddr = AUDIO_MAL_DMA_DREG;
    //DmaHandle.Init.DMA_PeripheralBaseAddr =  AUDIO_MAL_DMA_DREG;
    //DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)0;      /* This field will be configured in play function */
     //DmaHandle.Init.DMA_MemoryBaseAddr = (uint32_t)0;
    //DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	 DmaHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    //DMA_InitStructure.DMA_BufferSize = (uint32_t)0xFFFE;      /* This field will be configured in play function */
	//DmaHandle.Init.DMA_BufferSize = (uint32_t)0xFFFE;
    //DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DmaHandle.Init.PeriphInc = DMA_PINC_ENABLE;
    //DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DmaHandle.Init.MemInc = DMA_MINC_ENABLE;
    //DMA_InitStructure.DMA_PeripheralDataSize = AUDIO_MAL_DMA_PERIPH_DATA_SIZE;
	//DmaHandle.Init.DMA_PeripheralDataSize = AUDIO_MAL_DMA_PERIPH_DATA_SIZE;
    //DMA_InitStructure.DMA_MemoryDataSize = AUDIO_MAL_DMA_MEM_DATA_SIZE; 
       DmaHandle.Init.MemDataAlignment = AUDIO_MAL_DMA_MEM_DATA_SIZE; 
#ifdef AUDIO_MAL_MODE_NORMAL
    //DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DmaHandle.Init.Mode = DMA_NORMAL;
#elif defined(AUDIO_MAL_MODE_CIRCULAR)
    //DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DmaHandle.Init.Mode = DMA_CIRCULAR;
#else
#error "AUDIO_MAL_MODE_NORMAL or AUDIO_MAL_MODE_CIRCULAR should be selected !!"
#endif /* AUDIO_MAL_MODE_NORMAL */  
    //DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DmaHandle.Init.Priority = DMA_PRIORITY_HIGH;
    //DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;         
	DmaHandle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    //DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;
    DmaHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_1QUARTERFULL;
    //DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	DmaHandle.Init.MemBurst = DMA_MBURST_SINGLE;
    //DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;  
    DmaHandle.Init.PeriphBurst = DMA_PBURST_SINGLE;

	DmaHandle.Instance = AUDIO_MAL_DMA_STREAM;
    //DMA_Init(AUDIO_MAL_DMA_STREAM, &DMA_InitStructure);  
    
    /* Enable the selected DMA interrupts (selected in "audio_codec.h" defines) */
#ifdef AUDIO_MAL_DMA_IT_TC_EN
    //DMA_ITConfig(AUDIO_MAL_DMA_STREAM, DMA_IT_TC, ENABLE);
    __HAL_DMA_ENABLE_IT(&DmaHandle, DMA_IT_TC);
    //__HAL_DMA_ENABLE(&DmaHandle);
#endif /* AUDIO_MAL_DMA_IT_TC_EN */
#ifdef AUDIO_MAL_DMA_IT_HT_EN
    DMA_ITConfig(AUDIO_MAL_DMA_STREAM, DMA_IT_HT, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_HT_EN */
#ifdef AUDIO_MAL_DMA_IT_TE_EN
    DMA_ITConfig(AUDIO_MAL_DMA_STREAM, DMA_IT_TE | DMA_IT_FE | DMA_IT_DME, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_TE_EN */

    /* Initialize the DMA stream ##########################################*/
    HAL_DMA_Init(&DmaHandle);

#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
    /* I2S DMA IRQ Channel configuration */
    //NVIC_InitStructure.NVIC_IRQChannel = AUDIO_MAL_DMA_IRQ;
    //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = AUDIO_IRQ_PREPRIO;
    //NVIC_InitStructure.NVIC_IRQChannelSubPriority = AUDIO_IRQ_SUBRIO;
    //NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    //NVIC_Init(&NVIC_InitStructure);

    /* Set Interrupt Group Priority */
    HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, 0, 0);
    /* Enable the DMA STREAM global Interrupt */
    HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);

#endif     
  }

#ifdef DAC_USE_I2S_DMA
  else
  {
    /* Enable the DMA clock */
    //RCC_AHB1PeriphClockCmd(AUDIO_MAL_DMA_CLOCK, ENABLE); 
	__HAL_RCC_DMA1_IS_CLK_ENABLED();  
    
