PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/audio_codec.c
    /* Configure the DMA Stream */
    DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);
    DMA_DeInit(AUDIO_MAL_DMA_STREAM);
    /* Set the parameters to be configured */
    //DMA_InitStructure.DMA_Channel = AUDIO_MAL_DMA_CHANNEL;  
	DmaHandle.Init.Channel = AUDIO_MAL_DMA_CHANNEL;
    //DMA_InitStructure.DMA_PeripheralBaseAddr = AUDIO_MAL_DMA_DREG;
	DmaHandle.Init.DMA_PeripheralBaseAddr =  AUDIO_MAL_DMA_DREG;
    //A_InitStructure.DMA_Memory0BaseAddr = (uint32_t)0;      /* This field will be configured in play function */
    DmaHandle.Init.DMA_MemoryBaseAddr = (uint32_t)0;
    //A_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	DmaHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    //A_InitStructure.DMA_BufferSize = (uint32_t)0xFFFE;      /* This field will be configured in play function */
	DmaHandle.Init.DMA_BufferSize = (uint32_t)0xFFFE;
    //A_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DmaHandle.Init.PeriphInc = DMA_PINC_ENABLE;
    //DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DmaHandle.Init.MemInc = DMA_MINC_ENABLE;
    //DMA_InitStructure.DMA_PeripheralDataSize = AUDIO_MAL_DMA_PERIPH_DATA_SIZE;
	DmaHandle.Init.DMA_PeripheralDataSize = AUDIO_MAL_DMA_PERIPH_DATA_SIZE;
    //DMA_InitStructure.DMA_MemoryDataSize = AUDIO_MAL_DMA_MEM_DATA_SIZE; 
	DmaHandle.Init.DMA_MemoryDataSize = AUDIO_MAL_DMA_MEM_DATA_SIZE;

#ifdef AUDIO_MAL_MODE_NORMAL
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
#elif defined(AUDIO_MAL_MODE_CIRCULAR)
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
#else
#error "AUDIO_MAL_MODE_NORMAL or AUDIO_MAL_MODE_CIRCULAR should be selected !!"
#endif /* AUDIO_MAL_MODE_NORMAL */  
    //DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DmaHandle.Init.DMA_Priority = DMA_Priority_High;
    //DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
	DmaHandle.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
    //DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
    DmaHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
    //DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  	DmaHandle.Init.MemBurst = DMA_MBURST_SINGLE;  
    //DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;  
    DmaHandle.Init.PeriphBurst = DMA_PBURST_SINGLE;

	DmaHandle.Instance = AUDIO_MAL_DMA_STREAM;

    //DMA_Init(AUDIO_MAL_DMA_STREAM, &DMA_InitStructure);  
    
    /* Enable the selected DMA interrupts (selected in "audio_codec.h" defines) */
#ifdef AUDIO_MAL_DMA_IT_TC_EN
    DMA_ITConfig(AUDIO_MAL_DMA_STREAM, DMA_IT_TC, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_TC_EN */
#ifdef AUDIO_MAL_DMA_IT_HT_EN
    DMA_ITConfig(AUDIO_MAL_DMA_STREAM, DMA_IT_HT, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_HT_EN */
#ifdef AUDIO_MAL_DMA_IT_TE_EN
    DMA_ITConfig(AUDIO_MAL_DMA_STREAM, DMA_IT_TE | DMA_IT_FE | DMA_IT_DME, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_TE_EN */

    /* Initialize the DMA stream ##########################################*/
    HAL_DMA_Init(&DmaHandle);
    
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
    /* I2S DMA IRQ Channel configuration */
    //NVIC_InitStructure.NVIC_IRQChannel = AUDIO_MAL_DMA_IRQ;
    //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = AUDIO_IRQ_PREPRIO;
    //NVIC_InitStructure.NVIC_IRQChannelSubPriority = AUDIO_IRQ_SUBRIO;
    //NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    //NVIC_Init(&NVIC_InitStructure);

	/* Set Interrupt Group Priority */
    HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 0, 0);
	/* Enable the DMA STREAM global Interrupt */
	HAL_NVIC_EnableIRQ(AUDIO_MAL_DMA_STREAM);

#endif 


  }
#endif /* DAC_USE_I2S_DMA */
  
  if (CurrAudioInterface == AUDIO_INTERFACE_I2S)
  {
    /* Enable the I2S DMA request */
    //SPI_I2S_DMACmd(CODEC_I2S, SPI_I2S_DMAReq_Tx, ENABLE); 
    __HAL_I2S_ENABLE_IT(&hi2s3, SPI_I2S_DMAReq_Tx);
  }
  else
  {
    /* Configure the STM32 DAC to geenrate audio analog signal */
    DAC_Config();
    
#ifndef DAC_USE_I2S_DMA
    /* Enable the I2S interrupt used to write into the DAC register */
    //SPI_I2S_ITConfig(SPI3, SPI_I2S_IT_TXE, ENABLE);
    
    /* I2S DMA IRQ Channel configuration */
    //NVIC_InitStructure.NVIC_IRQChannel = CODEC_I2S_IRQ;
    //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = AUDIO_IRQ_PREPRIO;
    //NVIC_InitStructure.NVIC_IRQChannelSubPriority = AUDIO_IRQ_SUBRIO;
    //NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    //NVIC_Init(&NVIC_InitStructure); 

    hi2s3.Instance = SPI3;
    hi2s3.Init.Mode = I2S_MODE_MASTER_TX;
    //hspi5.RxISR = SPI5_CallBack;
    HAL_I2S_Init(&hi2s3);

    /* Enable TXE interrupt */
    __HAL_SPI_ENABLE_IT(&hi2s3, I2S_IT_TXE);
    __HAL_SPI_ENABLE(&hi2s3);
#else
    /* Enable the I2S DMA request */
    //SPI_I2S_DMACmd(CODEC_I2S, SPI_I2S_DMAReq_Rx, ENABLE);   
     __HAL_I2S_ENABLE(&hi2s3, SPI_I2S_DMAReq_Tx);
#endif /* DAC_USE_I2S_DMA */
  }
#endif
}

/**
  * @brief  Restore default state of the used Media.
  * @param  None
  * @retval None
  */
static void Audio_MAL_DeInit(void)  
{   
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
  //NVIC_InitTypeDef NVIC_InitStructure;  
  
  /* Deinitialize the NVIC interrupt for the I2S DMA Stream */
  //NVIC_InitStructure.NVIC_IRQChannel = AUDIO_MAL_DMA_IRQ;
  //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = AUDIO_IRQ_PREPRIO;
  //NVIC_InitStructure.NVIC_IRQChannelSubPriority = AUDIO_IRQ_SUBRIO;
  //NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  //NVIC_Init(&NVIC_InitStructure);  
#endif 
  
  /* Disable the DMA stream before the deinit */
  //DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);
  
  /* Dinitialize the DMA Stream */
  //DMA_DeInit(AUDIO_MAL_DMA_STREAM);
  
  /* 
     The DMA clock is not disabled, since it can be used by other streams 
                                                                          */ 
}

/**
  * @brief  Starts playing audio stream from the audio Media.
  * @param  None
  * @retval None
  */
void Audio_MAL_Play(uint32_t Addr, uint32_t Size)
{         
  if (CurrAudioInterface == AUDIO_INTERFACE_I2S)
  {
    /* Configure the buffer address and size */
    //DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)Addr;
    //DMA_InitStructure.DMA_BufferSize = (uint32_t)Size/2;
    
